app/controllers/admin/brands_controller.rb

  def index
    @brands = Brand.paginate(:per_page => 20, :page => params[:page])
---
SELECT COUNT(*) FROM `brands`
SELECT `brands`.* FROM `brands` LIMIT 20 OFFSET 0