app/controllers/admin/product_categories_controller.rb

  def index
    @admin_product_categories = ProductCategory.all
---
SELECT `product_categories`.* FROM `product_categories`

  def show
    @admin_product_category = ProductCategory.find(params[:id])
---
SELECT `product_categories`.* FROM `product_categories` WHERE `product_categories`.`id` = 1 LIMIT 1

  def edit
    @product_category = ProductCategory.find(params[:id])
---
SELECT `product_categories`.* FROM `product_categories` WHERE `product_categories`.`id` = 1 LIMIT 1

  def create
    @product_category = ProductCategory.new(params[:product_category])

    respond_to do |format|
      if @product_category .save
---
INSERT INTO `product_categories` (`rgt`, `created_at`, `name`, `updated_at`, `parent_id`, `lft`) VALUES (NULL, '2011-07-16 18:26:31', 'qweqwe123123', '2011-07-16 18:26:31', 0, NULL)

  def update
    @product_category = ProductCategory.find(params[:id])

    respond_to do |format|
      if @product_category.update_attributes(params[:product_category])
---
SELECT `product_categories`.* FROM `product_categories` WHERE `product_categories`.`id` = 1 LIMIT 1
UPDATE `product_categories` SET `updated_at` = '2011-07-17 02:11:32', `name` = '乳液/凝露/啫哩' WHERE `product_categories`.`id` = 4

  def destroy
    @admin_product_category = ProductCategory.find(params[:id])
    @admin_product_category.destroy
---
SELECT `product_categories`.* FROM `product_categories` WHERE `product_categories`.`id` = 3 LIMIT 1
DELETE FROM `product_categories` WHERE `product_categories`.`id` = 3