app/controllers/admin/products_controller.rb

SELECT COUNT(*) FROM `products` WHERE (tags like '%保湿%')
SELECT `products`.* FROM `products` WHERE (recommend = true) AND (tags like '%薇姿%') LIMIT 50 OFFSET 0
---
  def index
    unless params[:tag].blank?
      conditions = ["tags like ?", "%#{params[:tag]}%"]
    end

    @products = Product.paginate(:per_page => 20, :page => params[:page], :conditions => conditions)

SELECT `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1
---
  def set_recommend
    tag = params[:tag]

    @product = Product.find(params[:id])