app/controllers/products_controller.rb

  def index
    @products = Product.paginate(:per_page => 20, :page => params[:page])
---
SELECT COUNT(*) FROM `products`
SELECT `products`.* FROM `products` LIMIT 20 OFFSET 0